WEBPSUB/actual/Sapmle_NE_Req_create.xml

<soapenv:Envelope xmlns:java="java:com.ericsson.umobileportal.wsserver.ws.data" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:u="http://www.u.com.my/">
   <soapenv:Header>
      <wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
         <wsse:UsernameToken wsu:Id="UsernameToken-7105761" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
            <wsse:Username>%s</wsse:Username>
            <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">%s</wsse:Password>
         </wsse:UsernameToken>
      </wsse:Security>
   </soapenv:Header>
   <soapenv:Body>
      <u:addNewPortalUser><u:request><java:RequestID>%s</java:RequestID><java:Msisdn>%s</java:Msisdn></u:request>
      </u:addNewPortalUser>
   </soapenv:Body>
</soapenv:Envelope>